Yii2/frontend/models/SignupForm.php

INSERT INTO `user` (`username`, `email`, `password_hash`, `auth_key`, `verification_token`, `status`, `created_at`, `updated_at`) VALUES ('admin', 'admin@mailinator.com', '$2y$13$gOp80Y1FuKDxeD5aTxKlaOCLumKtUuzcaPET56vm.kXYxSvHoGhbK', '3m87T_kmW2sL1DVDh_qHNIx8GJu3plvc', 'VSgR_nbUUNacL0FkH9OruErPAdeSyxmO_1607527887', 9, 1607527887, 1607527887)
---
    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->generateEmailVerificationToken();
        return $user->save() && $this->sendEmail($user);